{"pages":[{"title":"关于我","text":"冷漠，略微爱表现，无慈悲心，温和。经常对自己很愤怒，唯有明确指令才能好好完成。没有才华却很贪心的人。 顺带，我这个人不怎么记仇，只不过当我决定报复的时候会准备周密（当然可能需要很长时间），在此期间无论发生什么事都不会让我停止准备复仇的举措。出事了别让我担责任，不然你做鬼我也不会放过你。 以前常有人说“真搞不懂你在想什么”。父母这么说，班导也这么说。昨天第一次遇到，不太熟的人也这么说。大家也叫我多多敞开心胸。但这怎么行呢！要是坦诚相见说出真心话的话，当场就会绝交。正因为我封闭了丑陋的内心，才能跟人交际应酬。臭掉的东西要再加盖，这是跟邻居相处的礼貌。说“搞不懂我在想什么”，其实我也不知道自己的真心话。我究竟想做什么呢？我到底想画怎样的漫画呢？我是什么？你是我什么呢？有没有什么呢？真抱歉。我的心有两道门，里面那道我也打不开。","path":"about/index.html","date":"03-24","excerpt":""},{"title":"分类","text":"","path":"categories/index.html","date":"03-02","excerpt":""},{"title":"标签","text":"","path":"tags/index.html","date":"03-02","excerpt":""}],"posts":[{"title":"Dictionary","text":"","path":"2018/08/02/Dictionary/","date":"08-02","excerpt":""},{"title":"赞美盛夏里向日葵的回忆","text":"&emsp;&emsp;朋友啊，你还好吗？身没有崩坏吧？心没有磨损吧？ &emsp;&emsp;因为你是个担心许许多多，却对自己疏忽大意的人啊。 &emsp;&emsp;都会的喧嚣、匆忙，你一定每天都生活得兢兢业业吧，不懂得懈怠的你，想必已经身心俱惫了。 &emsp;&emsp;朋友啊，让你的翅膀休憩片刻吧。回到那个记忆的村庄吧。让一望无垠的蓝天，海角盛开的向日葵，再一次浮现在你的心胸吧。 &emsp;&emsp;你听到了吗？那钟声。每天早上你敲响的祝福村子新的一天的声音。你敲响的钟声现在也在我的心中回响。 &emsp;&emsp;时过境迁，人们背井离乡，夏季的钟声也消失了。小小的村中教会，也要合并进旁边城里的大教会。 &emsp;&emsp;朋友啊，我希望，可以再一次与你祈福，致这小小的教会，小小的十字架。致这深远的回忆。 &emsp;&emsp;但愿这个夏天的回忆，可以充满了我们对未来的希望。 &emsp;&emsp;朋友啊，我期待着你的归来。","path":"2018/05/28/赞美盛夏里向日葵的回忆/","date":"05-28","excerpt":""},{"title":"把sublime text 3添加到右键菜单","text":"&emsp;&emsp;安装过Notepad++的人都知道，在右键菜单里的那个用notepad++编辑是多么方便的存在，但是更好看可定制性更强的sublime text3却没有这个功能。作为转投st3的笔者来说，怎么会就此甘心？当然肯定是要尽力消除这个差异的。本文即为摸索出来的方案，在此发布，权作笔记以免遗忘。 &emsp;&emsp;既然要对右键菜单动手，那么一定是向注册表里做些什么。首先win+r调出运行，运行regedit，然后点开计算机\\HKEY_CLASSES_ROOT\\ *\\shell。至此，在右边空白处右键添加一个项，起名就叫用ST3编辑就好了，实际上起什么都行，这个实现的就是在右键菜单里显示的文字。如图：&emsp;&emsp;第二步，在用ST3打开中右键空白处，添加字符串，起名叫Icon，数值数据改成ST3启动程序的路径后面跟上半角状态下的逗号,和0。这样一来，就可以调用ST3本身的图标作为右键菜单上的图标了。如图：&emsp;&emsp;最后一步，如第二步一开始一样右键，新建项Command，修改那个默认字符串的数值数据，改为ST3启动程序路径加个空格还有%1。如图：&emsp;&emsp;大功告成 顺带一提，ST3的路径可以直接找到那个程序，然后按住shift再右键，就能直接复制为路径了，不过会出现多余的一前一后两个引号。","path":"2018/04/15/ST3使用备份/","date":"04-15","excerpt":""},{"title":"撒旦教/撒旦崇拜","text":"THE NINE SATANIC STATEMENTS1. Satan represents indulgence, instead of abstinence!撒旦代表了豁欲，而不是无节制。2. Satan represents vital existence, instead of spiritual pipe dreams!撒旦代表肉体生命的真实存在，而不是精神上的伪善幻想。3. Satan represents undefiled wisdom, instead of hypocritical self-deceit!撒旦代表最纯粹的智慧，而不是自欺欺人的猜测。4. Satan represents kindness to those who deserve it, instead of love wasted on ingrates!撒旦代表了对那些值得友善对待的人的善意，而不是对那些忘恩负义的人的爱。5. Satan represents vengeance, instead of turning the other cheek!撒旦代表有仇必报，而不是容忍。6. Satan represents responsibility to the responsible, instead of concern for psychic vampires!撒旦主张担负应该的责任，而不是关心无谓的东西。7. Satan represents man as just another animal, sometimes better, more often worse than those that walk on all-fours, who, because of his “divine spiritual and intellectual development”, has become the most vicious animal of all!撒旦代表人类只不过是一种动物，并没有比较高尚。8. Satan represents all of the so-called sins, as they all lead to physical, mental, or emotional gratification!撒旦代表无视所谓的七原罪，因为他们会带来肉体、精神和感情上的满足。9. Satan has been the best friend the church has ever had, as he has kept it in business all these years!撒旦是教会前所未有的好朋友，因为他在这些年里维持了它的运作。The Nine Satanic Sins1. Stupidity 愚蠢The top of the list for Satanic Sins. The Cardinal Sin of Satanism. It’s too bad that stupidity isn’t painful. Ignorance is one thing, but our society thrives increasingly on stupidity. It depends on people going along with whatever they are told. The media promotes a cultivated stupidity as a posture that is not only acceptable but laudable. Satanists must learn to see through the tricks and cannot afford to be stupid.撒旦九罪之首，撒旦教主罪。对愚蠢的麻木是最坏的情况。无知是一方面，但社会的繁荣正是依赖于人们的愚昧。它源于人们对耳闻之事深信不疑。媒体促使这种情形不仅被人们所接受，甚至被广为称赞。撒旦崇拜者们必须学会从骗局中发掘真相并拒绝成为愚者。 2. Pretentiousness 自负Empty posturing can be most irritating and isn’t applying the cardinal rules of Lesser Magic. On equal footing with stupidity for what keeps the money in circulation these days. Everyone’s made to feel like a big shot, whether they can come up with the goods or not.言之无物虚张声势不仅令人怒不可遏，也有违Lesser Magic的基本规则。对眼下生财之道也采取同样愚蠢的方式。自负让每一个都被认为是个蠢货，不管他们是否能凭借那些小把戏取得成功。 3. Solipsism 唯我论Can be very dangerous for Satanists. Projecting your reactions, responses and sensibilities onto someone who is probably far less attuned than you are. It is the mistake of expecting people to give you the same consideration, courtesy and respect that you naturally give them. They won’t. Instead, Satanists must strive to apply the dictum of “Do unto others as they do unto you.” It’s work for most of us and requires constant vigilance lest you slip into a comfortable illusion of everyone being like you. As has been said, certain utopias would be ideal in a nation of philosophers, but unfortunately (or perhaps fortunately, from a Machiavellian standpoint) we are far from that point.这对于撒旦教徒来说非常危险。有些人不如你善于配合，你必须设定一套应对他们的方法。如果你期望他们对待你像你对待他们一样考虑周到，彬彬有礼，遵从有佳，那就错了。他们不会。相反，撒旦教徒时刻贯彻着“以其人之道还至其人之身”的格言。且时刻保持清醒以避免滑入他人都和你一样的幻觉中去。诚如人们所说，乌托邦主义只有在哲学家的国度中才是完美的想法。然而，很不幸地（或者根据马基亚维利的说法，很幸运地），我们距离这点很远。 4. Self-deceit 自欺It’s in the “Nine Satanic Statements” but deserves to be repeated here. Another cardinal sin. We must not pay homage to any of the sacred cows presented to us, including the roles we are expected to play ourselves. The only time self-deceit should be entered into is when it’s fun, and with awareness. But then, it’s not self-deceit!它曾在九训中出现，然而此刻仍值得重提。这是另一项主罪。我们没有必要对祭品或是食物保持尊敬，包括别人期望我们扮演的角色。自欺唯一合理出现的情形是那是有意为之的玩笑，但那已并非自欺。 5. Herd Conformity 随波逐流That’s obvious from a Satanic stance. It’s all right to conform to a person’s wishes, if it ultimately benefits you. But only fools follow along with the herd, letting an impersonal entity dictate to you. The key is to choose a master wisely instead of being enslaved by the whims of the many.根据撒旦的精神这是显而易见的。如果一个人的愿望令你受益，那么顺从它是理所应当的。但只有愚者才会顺应大众的意志，让众人对你发号施令。关键就在于，选择一个高明的领导者，而不是被群众的胡想所左右。 6. Lack of Perspective 缺乏立场Again, this one can lead to a lot of pain for a Satanist. You must never lose sight of who and what you are, and what a threat you can be, by your very existence. We are making history right now, every day. Always keep the wider historical and social picture in mind. That is an important key to both Lesser and Greater Magic. See the patterns and fit things together as you want the pieces to fall into place. Do not be swayed by herd constraints—know that you are working on another level entirely from the rest of the world.对于撒旦教徒来说这会是莫大的痛处。你必须清楚地看到你是谁，你要做什么，你的存在会带来什么样的负面影响。我们每时每刻都在创造历史。在你的脑海中铺展历史和社会的辽阔画面。这对Lesser Magic和Great Magic而言都非常重要。让一切各得其所，不要人云亦云——你要明白，如今你与世界的大部分人已不再处于同一个层次。 7. Forgetfulness of Past Orthodoxies 摒弃本源Be aware that this is one of the keys to brainwashing people into accepting something new and different, when in reality it’s something that was once widely accepted but is now presented in a new package. We are expected to rave about the genius of the creator and forget the original. This makes for a disposable society.要明白这是给人们洗脑并让他们接受新鲜事物的关键。虽然实际上那些新事物不过是将人们广为知晓和接受的事物改头换面。我们总是被期望对创造者的智慧顶礼膜拜，而忘记事物的本质和初始。这会铸成一个为所欲为，喜新厌旧的社会。 8. Counterproductive Pride 多余的自尊That first word is important. Pride is great up to the point you begin to throw out the baby with the bathwater. The rule of Satanism is: if it works for you, great. When it stops working for you, when you’ve painted yourself into a corner and the only way out is to say, I’m sorry, I made a mistake, I wish we could compromise somehow, then do it.“多余”这两个字很重要。当你与过去完全决裂时，自尊是重要的。撒旦教会的原则是：如果自尊对你有必要，那么很好。然而当你由于它而止步不前，走投无路，唯一的出路是说一句：“对不起，我犯了一个错误，我想我可以做出妥协。”那么就这样做吧。 9. Lack of Aesthetics 审美缺乏This is the physical application of the Balance Factor. Aesthetics is important in Lesser Magic and should be cultivated. It is obvious that no one can collect any money off classical standards of beauty and form most of the time so they are discouraged in a consumer society, but an eye for beauty, for balance, is an essential Satanic tool and must be applied for greatest magical effectiveness. It’s not what’s supposed to be pleasing—it’s what is. Aesthetics is a personal thing, reflective of one’s own nature, but there are universally pleasing and harmonious configurations that should not be denied.这是Balance Factor的基本运用。审美对Lesser Magic而言非常重要，需要培养。很显然，在这个令人失望的市场经济社会，古典的审美形式无法为你赚取财富。但一对能够发觉美丽，发掘和谐的眼睛是撒旦的基本工具。我们必须利用它来创造伟大而神奇的成果。它不是人们所期望的那种哗众取宠，它就是它。固然每个人有自己的审美标准，它反映个人的态度。但不能否认，仍有让大众感到愉悦和和谐的形式存在于世。 The Eleven Satanic Rules of the Earth1. Do not give opinions or advice unless you are asked.除非你被询问，否则不要发表意见或给予建议。2. Do not tell your troubles to others unless you are sure they want to hear them.除非你确定别人想听，否则不要对别人诉苦。3. When in another’s lair, show him respect or else do not go there.在别人的地盘中，要显示对他的尊敬，否则别去那里。4. If a guest in your lair annoys you, treat him cruelly and without mercy.如果一个客人在你的地盘侵犯了你，不要仁慈，要残忍地对待他。5. Do not make sexual advances unless you are given the mating signal.不要与别人发生肉体关系，除非你得到了发生关系的信号。6. Do not take that which does not belong to you unless it is a burden to the other person and he cries out to be relieved.不要拿不属于你的东西，除非这对其他人是种负担，且他们哭求解脱。7. Acknowledge the power of magic if you have employed it successfully to obtain your desires. If you deny the power of magic after having called upon it with success, you will lose all you have obtained.答谢能让你成功的达成你的欲望的能力，如果你在获得它赐予的成功后，否定这能力，你会损失所有你获得的东西。8. Do not complain about anything to which you need not subject yourself.不要抱怨于你无关的事。9. Do not harm little children.不要伤害小孩。10. Do not kill non-human animals unless you are attacked or for your food.不要杀害不是人类的动物，除非你被它们攻击，或是为了得到食物。11. When walking in open territory, bother no one. If someone bothers you, ask him to stop. If he does not stop, destroy him.当走在公共的地方，不要打扰别人。如果某人打扰了你，要求他停止。如果他依旧我行我素，灭了他。","path":"2018/03/07/satanism/","date":"03-07","excerpt":""},{"title":"test-audio","text":"本帖仅供测试这个插件效果如何 var ap = new APlayer({ element: document.getElementById(\"aplayer0\"), narrow: false, autoplay: false, showlrc: 0, music: { title: \"“白金disco”\", author: \"Melodic Taste\", url: \"https://raw.githubusercontent.com/yande0/yande00/master/baijin.mp3\", pic: \"https://github.com/yande0/yande00/raw/master/baijin.jpg\", } }); window.aplayers || (window.aplayers = []); window.aplayers.push(ap);","path":"2018/03/04/test-audio/","date":"03-04","excerpt":""},{"title":"关于git上CRLF的错误及解决办法","text":"相信用过git的Windows用户都见过这个warning 12warning: LF will be replaced by CRLFThe file will have its original line endings in your working directory. 看着不舒服，一出现一大溜。不过用Linux的git的应该没见过，区别就在此。 原因呢，就是Linux和Windows下的换行符不一样，Linux下是LF，Windows下是CRLF。用Windows保存文本的时候换行符自动转为CRLF，才会出现这种情况。 解决方法也就一行代码的事儿，禁止git自动转换换行符 1git config --global core.autocrlf false","path":"2018/03/02/关于git上CRLF的错误及解决办法/","date":"03-02","excerpt":""},{"title":"Ubuntu新手推荐配置","text":"&emsp;&emsp;以前因为win7老是卡欢迎，所以换了Ubuntu，用了之后觉得还不错。不过尽管Ubuntu是Linux中对新手友好的系统，但新手还是要多花点功夫才能适应。这次我来讲讲Ubuntu新手怎么做让新装的Ubuntu更好操作一点。&emsp;&emsp;假如你是笔记本电脑连WiFi的用户，你肯定会发现一个问题——电脑连不上WiFi。这是因为笔记本上的无线网卡驱动不是开源的，Ubuntu不能把它集成到自家系统里。那么怎么样迅速解决这个问题呢？我们需要连一个有线且不需要设置宽带的网线接进去（无线路由器的LAN口、办公室网线、手机USB共享网络等等）。然后进入系统设置-软件和更新，点进附加选项，可以看到有802无线网卡驱动，用它的专有驱动就行了。假如刷新不出来驱动的话，先在Ubuntu软件里设置一下服务器，用清华大学的或者163或者阿里云的都行，假如你住的地方偏远的话可以让系统自己测试一下哪个镜像站速度最快，选完之后让系统自己更新一下。之后肯定能见到802无线网卡的驱动。这样就解决了Ubuntu不能用WiFi的问题。&emsp;&emsp;接下来设置su密码。先打开终端（快捷键Ctrl+Alt+T），运行 1sudo passwd &emsp;&emsp;之后会提示你要sudo密码，输入就是了，密码输入时不可见，连遮掩*符号都看不到，可别以为是自己键盘坏了哟。sudo密码和su密码是不一样的（当然你也可以设置成一样的）。su是设置宽带必不可少的权限。&emsp;&emsp;那么下面就该更新软件源和电脑的环境了。同样，打开终端，运行 12sudo apt updatesudo apt upgrade 顺序别错了。或是 1sudo apt update &amp;&amp; sudo apt upgrade ​&emsp;&emsp;update很快就完事儿了，但是upgrade要更新个四五百条。假如软件源服务器没设置好的话……那速度慢得……跟百度云限速似的。 &emsp;&emsp;再往下就该是装软件了，终于到这一步了啊。前期装软件apt命令绝对是最常用的。我个人先推荐安装几个软件： 新立得包管理器 非常厉害的一个软件，Ubuntu必装。管理你下载的安装包。安装命令 1sudo apt install synaptic 文泉驿字体 文泉驿字体是开源的字体，挺好看的，很适合作为系统默认字体。安装命令 1sudo apt install ttf-wqy-zenhei Unity Tweak Tool 这个是用来设置桌面的，绝对比自带的强大的得多。可以在这里面设置文泉驿微米黑为默认字体。安装命令 1sudo apt install unity-tweak-tool GDebi 这个是用来安装下面要推荐的软件的deb包的。尽管Ubuntu自带的软件市场也能做到，但是软件市场安装deb包不太稳定，有时候玩命安装也安装不上，和Ubuntu早期使用的这个软件相比差得很多。安装命令 1sudo apt install gdebi WPS 我相信WPS你使用起来比Ubuntu自带的LibreOffice得心应手得多。这个就没安装命令了，因为是闭源的。用deb包安装。下载地址http://community.wps.cn/download/ 选对应的版本下载。下载了之后右键用GDebi打开。顺带，WPS打开之后会提示系统字体缺失，无视即可，缺失的字体假如不是专业人员的话是很难去使用的。Word打开之后首页默认是Docer，一堆广告，实际上那个页面右下角有设置，可以设置它不自动弹出。 Crossover Wine的商业版，可以运行很多Windows上的软件，功能非常强悍。最推崇用它安装TM2013，因为QQ没有适配Linux，而用wine配置QQ会出现各种各样的问题，而办公特化的QQ——TM2013则是可以很轻易的用wine安装。下载地址https://www.codeweavers.com/products/crossover-linux，支持正版。 Chrome浏览器 尽管自带的Firefox已经非常好用了，但我还是推荐安装Chrome浏览器，这是因为Chrome有一项黑科技——ARChon，这项黑科技可以让你的Chrome浏览器运行安卓APP。黑科技我们以后再说，先安装Chrome。现在只有64位。https://dl.google.com/linux/direct/google-chrome-stable_current_amd64.deb App Grid App Grid 是一款轻量级的Ubuntu软件中心，可安装闭源软件。比自带软件中心强，体积还小得多。安装命令有三条，按顺序运行 123sudo add-apt-repository ppa:appgrid/stablesudo apt updatesudo apt install appgrid 最后，到系统设置\\软件更新里面把appgrid的源停用了，因为appgrid的源的功能就只有安装它一个软件而已。 Ubuntu额外的版权受限程序 听名字就知道它是干吗用的。用App Grid安装即可。 KWPlayer 利用酷我音乐资源的开源在线音乐播放器。安装方法直接看开发者说明:https://github.com/LiuLang/kwplayer 网易云音乐 怎么说呢，这个据说还有一些bug，不过喜欢网易云音乐的话就安装呗，我倒是没试出来有什么明显bug。点此下载，用GDebi安装。","path":"2018/02/24/Ubuntu新手推荐设置/","date":"02-24","excerpt":""}]}